In [1]:
import numpy as np
import pandas as pd

### Merging 3 dataframes

In [5]:
employees=pd.DataFrame({
    'emp_id':[1,2,3,4,5],
    'name':['Akhil','sahil','Peter','Linda','Bob'],
    'department':['IT','IT','HR','Finance','HR'],
})

salaries=pd.DataFrame({
    'emp_id':[1,2,3,6,7],
    'salary':[80000,85000,65000,70000,75000],
    'bonus':[10000,5000,7000,4500,4000]
})

In [6]:
employees

   emp_id   name department
0       1  Akhil         IT
1       2  sahil         IT
2       3  Peter         HR
3       4  Linda    Finance
4       5    Bob         HR

In [7]:
salaries

   emp_id  salary  bonus
0       1   80000  10000
1       2   85000   5000
2       3   65000   7000
3       6   70000   4500
4       7   75000   4000

In [9]:
pd.merge(employees,salaries,on='emp_id')

   emp_id   name department  salary  bonus
0       1  Akhil         IT   80000  10000
1       2  sahil         IT   85000   5000
2       3  Peter         HR   65000   7000

In [10]:
pd.merge(employees,salaries,on='emp_id',how='inner')

   emp_id   name department  salary  bonus
0       1  Akhil         IT   80000  10000
1       2  sahil         IT   85000   5000
2       3  Peter         HR   65000   7000

In [11]:
pd.merge(employees,salaries,on='emp_id',how='outer')

   emp_id   name department   salary    bonus
0       1  Akhil         IT  80000.0  10000.0
1       2  sahil         IT  85000.0   5000.0
2       3  Peter         HR  65000.0   7000.0
3       4  Linda    Finance      NaN      NaN
4       5    Bob         HR      NaN      NaN
5       6    NaN        NaN  70000.0   4500.0
6       7    NaN        NaN  75000.0   4000.0

In [12]:
pd.merge(employees,salaries,on='emp_id',how='left')

   emp_id   name department   salary    bonus
0       1  Akhil         IT  80000.0  10000.0
1       2  sahil         IT  85000.0   5000.0
2       3  Peter         HR  65000.0   7000.0
3       4  Linda    Finance      NaN      NaN
4       5    Bob         HR      NaN      NaN

In [13]:
pd.merge(employees,salaries,on='emp_id',how='right')

   emp_id   name department  salary  bonus
0       1  Akhil         IT   80000  10000
1       2  sahil         IT   85000   5000
2       3  Peter         HR   65000   7000
3       6    NaN        NaN   70000   4500
4       7    NaN        NaN   75000   4000

### Concatination of 2 dataframes

In [15]:
df1=pd.DataFrame({
    'A':['A0','A1','A2'],
    'B':['B0','B1','B2'],
    'C':['C0','C1','C2']
})

df2=pd.DataFrame({
    'A':['A3','A4','A5'],
    'B':['B3','B4','B5'],
    'C':['C3','C4','C5']
})

In [16]:
df1

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [17]:
df2

    A   B   C
0  A3  B3  C3
1  A4  B4  C4
2  A5  B5  C5

In [18]:
pd.concat([df1,df2])

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
0  A3  B3  C3
1  A4  B4  C4
2  A5  B5  C5

In [19]:
pd.concat([df1,df2],axis=1)

    A   B   C   A   B   C
0  A0  B0  C0  A3  B3  C3
1  A1  B1  C1  A4  B4  C4
2  A2  B2  C2  A5  B5  C5

### Joining 2 dataframes

In [24]:
df1=pd.DataFrame({
    'name':['Alice','Bob','Charle']
},index=[1,2,3])

df2=pd.DataFrame({
    'score':[85,90,75]
},index=[2,3,4])

In [25]:
df1

     name
1   Alice
2     Bob
3  Charle

In [26]:
df2

   score
2     85
3     90
4     75

In [27]:
df1.join(df2)

     name  score
1   Alice    NaN
2     Bob   85.0
3  Charle   90.0

In [28]:
df2.join(df1)

   score    name
2     85     Bob
3     90  Charle
4     75     NaN